In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
ser1 = Series([0,1,2],index = ['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [4]:
ser2 = Series([3,4,5,6], index = ['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [5]:
ser1+ser2

A     3
B     5
C     7
D   NaN
dtype: float64

In [18]:
df1 = DataFrame(np.arange(4).reshape((2,2)),columns = list('AB'),index = ['NYC','LA'])
df1

     A  B
NYC  0  1
LA   2  3

In [22]:
df2 = DataFrame(np.arange(9).reshape((3,3)), index = ['NYC','SFO','LA'], columns = list('ADC'))
df2

     A  D  C
NYC  0  1  2
SFO  3  4  5
LA   6  7  8

In [23]:
df1+df2

      A   B   C   D
LA    8 NaN NaN NaN
NYC   0 NaN NaN NaN
SFO NaN NaN NaN NaN

In [24]:
df1

     A  B
NYC  0  1
LA   2  3

In [25]:
df2

     A  D  C
NYC  0  1  2
SFO  3  4  5
LA   6  7  8

In [27]:
df1.add(df2,fill_value = 0)

     A   B  C  D
LA   8   3  8  7
NYC  0   1  2  1
SFO  3 NaN  5  4

In [28]:
df2.ix[2]

A    6
D    7
C    8
Name: LA, dtype: int32

In [30]:
ser3 = df2.ix[0]
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [36]:
df2-ser3

     A  D  C
NYC  0  0  0
SFO  3  3  3
LA   6  6  6